Repository: Saidalo1/power_met_bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: uz

# GREETING_TEXT
source: Hello! You are welcomed by the campaign - POWERMET INTERNATIONAL, we specialize in gasoline and diesel generators, on our service you have the opportunity to get advice or choose a generator for yourself🏭
uz: Salom! Sizni POWERMET INTERNATIONAL aksiyasi kutib oladi, biz benzin va dizel generatorlariga ixtisoslashganmiz, bizning xizmatimizda siz maslahat olish yoki o'zingiz uchun generator tanlash imkoniga egasiz🏭

# ERROR_LANGUAGE
source: ❌ Oops, it seems you entered incorrectly! Please select one of the options using the buttons. 👇
uz: ❌ Xato, ko'rib turganicha, xato kiritdingiz! Iltimos, tugmalar yordamida variantlardan birini tanlang. 👇

# CONSULT
source: Consultation
uz: Maslahatlashuv

# CALCULATE
source: Calculation
uz: Hisob

# SEND_NAME_TEXT
source: 📝 Please, enter your name.
uz: 📝 Iltimos, ismingizni kiriting

source: ❌ CANCEL
uz: ❌ BEKOR QILISH

# SEND_PHONE_TEXT
source: 📞 Please share your phone number by tapping the button below:
uz: 📞 Iltimos, telefon raqamingizni quyidagi tugmaga bosing:

source: 📞 Send Contact
uz: 📞 Telefon raqamni yuborish

# ERROR_NAME_TEXT
source: 🚫 Sorry, the name you entered is invalid. Please make sure to enter a valid name consisting of letters only (3-30 characters). Try again or click on the button below to start over🙁.
uz: 🚫 Kechirasiz, kiritgan ism noto'g'ri. Iltimos, faqat harflardan iborat to'g'ri ism kiriting (3-30 belgi). Qaytadan urinib ko'ring yoki pastdagi tugmani bosing🙁.

# SEND_ADDRESS_TEXT
source: 📮 Please send us your address so we can deliver your order.
uz: 📮 Iltimos, buyurtmangizni yetkazishimiz uchun manzilingizni yuboring.

source: 🌍 Send Location
uz: 🌍 Joylashuvni yuborish

source: Next➡️
uz: Keyingi➡️

source: Previous⬅️️
uz: Oldingi⬅️️

source: Current page📑
uz: Joriy sahifa📑

# CHOOSE_GENERATOR
source: Choose a generator
uz: Generator tanlang

source: Height:
uz: Balandligi:

source: Length:
uz: Uzunlik:

source: Width:
uz: Kengligi:

source: Back🔙
uz: Ortga🔙

source: Main Menu
uz: Bosh menu

source: Order
uz: Buyurtma

# CALL_FOR_ORDER
source: To order a generator, call the number:
uz: Generator zakaz qilish uchun, shu raqamga telefon qiling:

# BACK_MAIN_MENU
source: Back to main menu
uz: Bosh menyuga ortga

# BACK_TO_MENU_SELECT_LANGUAGE
source: Back to menu for select language
uz: Til o'zgartirish menyusiga ortga

# BACK_TO_MENU_SELECT_CATEGORY
source: Back to menu for select category
uz: Kategoriya tanlash menyusiga ortga

# RESEND_YOUR_NAME
source: Please, resend your name:
uz: Iltimos, ismingizni qayta jo'nating:

# RESEND_YOUR_CONTACT
source: Please, resend your contact:
uz: Iltimos, kontaktingizni qayta jo'nating:

source: Catalog
uz: Katalog

# CHOOSE_CATEGORY_OF_GENERATORS
source: Please, choose the category of generators:
uz: Iltimos, generatorlar kategoriyasini tanlang:

# GENERATOR_NOT_FOUND
source: Sorry, but generators not found!
uz: Kechirasiz, lekin generatorlar topilmadi!

source: Power
uz: Quvvati

source: Fuel type:
uz: Yoqilg'i turi:

# HEIGHT_LENGTH_WIDTH
source: Size(H/L/W):
uz: Hajmi (U/K/B):

source: Diesel
uz: Dizel

source: Working hours
uz: Ishlash vaqti

# FUEL_CONSUMPTION
source: Fuel consumption(l/h %75)
uz: Iste'mol(l/s %75)
